# Development
brew "git"
brew "git-extras"
brew "neovim"
brew "ctags"
brew "--HEAD universal-ctags/universal-ctags/universal-ctags"
brew "curl"

# Helpers
brew "ledger"
brew "coreutils"
brew "imagemagick"

# Python
brew "pipenv"
brew "pyenv"
brew "pyenv-virtualenv"

# Shell
brew "fish"
brew "ripgrep"
brew "tmux"
brew "fzf"
brew "grc"

# OSX
tap "koekeishiya/formulae"
brew "khd"
brew "chunkwm"
brew "contacts"

# Services
brew "awscli"

# Learning Tools
brew "exercism"

# Writing
brew "proselint"

# Emacs
cask "xquartz" # dependency for wordnet
brew "wordnet"
brew "languagetool"
brew "fd"
brew "shellcheck"
brew "aspell"

#######################

cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "caskroom/versions"
tap "caskroom/fonts"

# Development
tap "railwaycat/emacsmacport"
brew emacs-plus --with-no-frame-refocus --without-spacemacs-icon
cask "dash"
cask "gitup"
cask "kitty"
cask "sublime-text"
cask "font-fira-code"

cask "spotify"
cask "soulseek"
cask "google-chrome"
cask "firefox"

# Tools
cask "skim"
cask "numi"
cask "omnidisksweeper"
cask "alfred"
cask "contexts"
cask "appcleaner"
cask "zotero"
cask "dropbox"
cask "google-backup-and-sync"

# Create
cask "mactex"
cask "blender"

# Quicklook
cask "qlstephen"
cask "qlmarkdown"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlprettypatch"
cask "quicklook-csv"
cask "epubquicklook"
cask "quicklook-json"
