cask_args appdir: "/Applications"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

# Priority
tap "d12frosted/emacs-plus"
brew "emacs-plus", args: ["with-no-frame-refocus", "without-spacemacs-icon", "HEAD"]
cask "karabiner-elements"
cask "firefox-beta"
cask "kitty"

# Development
brew "git"
brew "git-extras"
brew "neovim"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "curl"
brew "npm"

# Helpers
brew "wget"
brew "ledger"
brew "coreutils"
brew "imagemagick"

# Python
brew "pipenv"
brew "pyenv"
brew "pyenv-virtualenv"

# Shell
brew "fish"
brew "ripgrep"
brew "rga"
brew "tmux"
brew "fzf"
brew "grc"

# OSX
tap "koekeishiya/formulae"
brew "skhd"
brew "yabai"
brew "contacts"

# Learning Tools
brew "exercism"

# Writing
brew "proselint"

# Emacs
cask "emacsclient"
cask "xquartz" # dependency for wordnet
brew "wordnet"
brew "fd"
brew "shellcheck"
brew "aspell"

#######################

# Development
cask "dash"
cask "gitup"
cask "sublime-text"
cask "font-firacode-nerd-font"
cask "java"
brew "languagetool"

cask "spotify"
cask "soulseek"
cask "google-chrome"

# Tools
cask "skim"
cask "calibre"
cask "anki"
cask "numi"
cask "omnidisksweeper"
cask "alfred"
cask "contexts"
cask "appcleaner"
cask "zotero"
cask "dropbox"

# Create
cask "mactex"
cask "blender"

# Quicklook
cask "qlstephen"
cask "qlmarkdown"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlprettypatch"
cask "quicklook-csv"
cask "epubquicklook"
cask "quicklook-json"
