cask_args appdir: "/Applications"
tap "homebrew/cask"  
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

# Priority
cask "karabiner-elements"
cask "firefox-nightly"
cask "kitty"

## Emacs
tap "d12frosted/emacs-plus"
brew "gcc"
brew "libgccjit", args: ["build-from-source"]
brew "emacs-plus@28", args: ["with-native-comp", "with-no-frame-refocus", "with-xwidgets"]
brew "fd"
# cask "emacsclient"
brew "proselint"
brew "languagetool"
brew "aspell"
cask "xquartz" # dependency for wordnet
brew "wordnet"

# Development
brew "git"
brew "git-extras"
brew "neovim"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "curl"
brew "npm"
brew "jq"
brew "direnv"
brew "starship"
brew "pipx"
brew "shfmt" # for formatting bash
brew "editorconfig"
brew "pngpaste"

# Helpers
brew "wget"
brew "ledger"
brew "coreutils"
brew "imagemagick"

# Python
brew "pyenv"

# Shell
brew "fish"
brew "ripgrep"
brew "rga"
brew "tmux"
brew "fzf"
brew "grc"

# OSX
tap "koekeishiya/formulae"
brew "skhd"
brew "yabai"

# Learning Tools
cask "anki"
brew "exercism"

# Writing
brew "tectonic" # tex
## Emacs
brew "ruby"

#######################

# Development
cask "dash"
cask "gitup"
cask "maccy"
cask "font-fira-code"

# Media
cask "spotify"
cask "soulseek"
cask "google-chrome"

# Comms
cask "zoom"
cask "slack"  
cask "screen"
cask "skype"

# Tools
cask "skim"
cask "calibre"
cask "numi"
cask "omnidisksweeper"
cask "alfred"
cask "contexts"
cask "appcleaner"
cask "zotero"

# Create
cask "blender"

# Quicklook
cask "qlstephen"
cask "qlmarkdown"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlprettypatch"
cask "quicklook-csv"
cask "quicklook-json"
