tap 'caskroom/versions'
tap 'caskroom/fonts'

# Apps
cask 'gitup'
cask 'postman'
cask 'sublime-text3'
cask 'java'
cask 'google-chrome'
cask 'slack'
cask 'zotero'
cask 'appcleaner'
cask 'grammarly'
cask 'dropbox'
cask 'google-drive'
cask 'numi'
cask 'togglDesktop'
cask 'amphetamine'
cask 'sketch'
cask 'iterm2'
cask 'font-fira-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlimagesize'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'animated-gif-quicklook'
cask 'epubquicklook'

